---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewFailures.CannotPasteViewReferences
source: html/811c3d5b-b1b3-66eb-c441-fa314437f103.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewFailures.CannotPasteViewReferences Property

Cannot paste view references into the view they reference or into unrelated views

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotPasteViewReferences { get; }
```